CSU-iMag/ArtificialIntelligenceCar/Project/MDK/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: MIMXRT1064xxxxA
package_id: MIMXRT1064DVL6A
mcu_data: ksdk2_0
processor_version: 7.0.1
board: MIMXRT1064-EVK
pin_labels:
- {pin_num: D7, pin_signal: GPIO_B0_00, label: LSB, identifier: LCDIF_CLK;LSB1;LSB2}
- {pin_num: E7, pin_signal: GPIO_B0_01, label: LSB, identifier: LCDIF_ENABLE;DIR1;LSB1}
- {pin_num: E8, pin_signal: GPIO_B0_02, label: DIR, identifier: LCDIF_HSYNC;LSB2;DIR2}
- {pin_num: C9, pin_signal: GPIO_B0_09, label: LED, identifier: LCDIF_D5;LED}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: BEEP, identifier: LCDIF_D12;MOTOR_L;BEEP}
- {pin_num: B11, pin_signal: GPIO_B1_01, label: LCDIF_D13, identifier: LCDIF_D13;MOTOR_R}
- {pin_num: C11, pin_signal: GPIO_B1_02, label: LCDIF_D14, identifier: LCDIF_D14;HAL}
- {pin_num: D11, pin_signal: GPIO_B1_03, label: LCDIF_D15, identifier: LCDIF_D15;LED1}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: ENET_RXD0, identifier: ENET_RXD0;MOTOR_EN}
- {pin_num: D12, pin_signal: GPIO_B1_05, label: ENET_RXD1, identifier: ENET_RXD1;SW6;SW5;INT}
- {pin_num: B12, pin_signal: GPIO_B1_07, label: ENET_TXD0, identifier: ENET_TXD0;LED3}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: DIR, identifier: ENET_TXD1;DIR2;DIR1}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: ENET_TXEN, identifier: ENET_TXEN;SW5;BEEP}
- {pin_num: C13, pin_signal: GPIO_B1_11, label: OLED, identifier: ENET_RXER;SW6;DC}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: OLED, identifier: SD_CD_SW;UART5_TX;RES}
- {pin_num: D14, pin_signal: GPIO_B1_13, label: WDOG_B, identifier: WDOG_B;UART5_RX}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: MOTOR, identifier: BACKLIGHT_CTL;LED2;STEER}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: 'USB_HOST_OC/J24[10]', identifier: CS}
- {pin_num: H10, pin_signal: GPIO_AD_B0_01, label: KEY, identifier: D1;K2;K_RIGHT}
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: 'USB_OTG1_PWR/J24[2]', identifier: D0}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: KEY, identifier: DC;K6;K_UP}
- {pin_num: G13, pin_signal: GPIO_AD_B0_10, label: MOTOR, identifier: INT1_COMBO;RIGHT}
- {pin_num: G10, pin_signal: GPIO_AD_B0_11, label: MOTOR, identifier: INT2_COMBO;LEFT}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: HAL, identifier: UART1_TXD;HAL1}
- {pin_num: H14, pin_signal: GPIO_AD_B0_14, label: KEY, identifier: CAN2_TX;AD_CH2;K4;DOWN;K_DOWN}
- {pin_num: L10, pin_signal: GPIO_AD_B0_15, label: KEY, identifier: CAN2_RX;AD_CH3;K5;OKEY;K_OK}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: IIC, identifier: I2C_SCL_FXOS8700CQ;CSI_I2C_SCL;AD_CH4;SCL}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: IIC, identifier: I2C_SDA_FXOS8700CQ;CSI_I2C_SDA;AD_CH5;SDA}
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: KEY, identifier: SPDIF_OUT;AD_CH7;K1;K_BACK}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: KEY, identifier: SPDIF_IN;AD_CH6;K3;LEFT;K_LEFT}
- {pin_num: H13, pin_signal: GPIO_AD_B1_08, label: 'AUD_INT/CSI_D9//J35[13]/J22[4]', identifier: CSI_D9;AD_CH11}
- {pin_num: M13, pin_signal: GPIO_AD_B1_09, label: 'SAI1_MCLK/CSI_D8/J35[11]', identifier: CSI_D8;AD_CH12}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: K66, identifier: CSI_D7;AD_BAT;MTSR}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: K66, identifier: CSI_D6;AD_CH1;MRST}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: 'SAI1_RXD/CSI_D5/J35[5]/U13[16]', identifier: CSI_D5;SW4;SCL}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: OLED, identifier: CSI_D4;SW3;SDA;MOSI}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: OLED, identifier: CSI_D3;SW1;CLK}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: MOTOR, identifier: CSI_D2;SW2;DIR;DIRECT}
- {pin_num: L5, pin_signal: GPIO_SD_B1_00, label: COM, identifier: FlexSPI_D3_B;MOTOR_L;RES;TXD}
- {pin_num: M5, pin_signal: GPIO_SD_B1_01, label: COM, identifier: FlexSPI_D2_B;MOTOR_R;SDA;SW5;COM;RXD}
- {pin_num: M3, pin_signal: GPIO_SD_B1_02, label: FlexSPI_D1_B, identifier: FlexSPI_D1_B;STEERING}
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: FlexSPI_D0_B, identifier: FlexSPI_D0_B;SCL;SW4}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: HAL, identifier: HAL2}
- {pin_num: L12, pin_signal: GPIO_AD_B1_04, label: BAT, identifier: CSI_PIXCLK;AD_CH8;BAT}
- {pin_num: K12, pin_signal: GPIO_AD_B1_05, label: 'CSI_MCLK/J35[12]/J23[4]', identifier: CSI_MCLK;AD_CH9}
- {pin_num: J12, pin_signal: GPIO_AD_B1_06, label: 'CSI_VSYNC/J35[18]/J22[2]/UART_TX', identifier: CSI_VSYNC;AD_CH10}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: P2, peripheral: GPIO3, signal: 'gpio_io, 04', pin_signal: GPIO_SD_B1_04, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge, hysteresis_enable: Enable,
    pull_up_down_config: no_init, pull_keeper_enable: Disable, slew_rate: Fast}
  - {pin_num: K14, peripheral: GPIO1, signal: 'gpio_io, 12', pin_signal: GPIO_AD_B0_12, identifier: HAL1, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge,
    hysteresis_enable: Enable, pull_up_down_config: no_init, pull_keeper_enable: Disable, slew_rate: Fast}
  - {pin_num: L11, peripheral: GPIO1, signal: 'gpio_io, 18', pin_signal: GPIO_AD_B1_02, identifier: K_BACK, direction: INPUT, hysteresis_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: M12, peripheral: GPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AD_B1_03, identifier: K_LEFT, direction: INPUT, hysteresis_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: H10, peripheral: GPIO1, signal: 'gpio_io, 01', pin_signal: GPIO_AD_B0_01, identifier: K_RIGHT, direction: INPUT, hysteresis_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: G11, peripheral: GPIO1, signal: 'gpio_io, 03', pin_signal: GPIO_AD_B0_03, identifier: K_UP, direction: INPUT, hysteresis_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: L10, peripheral: GPIO1, signal: 'gpio_io, 15', pin_signal: GPIO_AD_B0_15, identifier: K_OK, direction: INPUT, hysteresis_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: H14, peripheral: GPIO1, signal: 'gpio_io, 14', pin_signal: GPIO_AD_B0_14, identifier: K_DOWN, direction: INPUT, hysteresis_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: M5, peripheral: LPUART4, signal: RX, pin_signal: GPIO_SD_B1_01, identifier: RXD, speed: MHZ_100, slew_rate: Fast}
  - {pin_num: L5, peripheral: LPUART4, signal: TX, pin_signal: GPIO_SD_B1_00, identifier: TXD, slew_rate: Fast}
  - {pin_num: D7, peripheral: TMR1, signal: 'TIMER, 0', pin_signal: GPIO_B0_00, identifier: LSB2, slew_rate: Fast}
  - {pin_num: E7, peripheral: TMR1, signal: 'TIMER, 1', pin_signal: GPIO_B0_01, identifier: LSB1, slew_rate: Fast}
  - {pin_num: E8, peripheral: TMR1, signal: 'TIMER, 2', pin_signal: GPIO_B0_02, identifier: DIR2}
  - {pin_num: A12, peripheral: TMR1, signal: 'TIMER, 3', pin_signal: GPIO_B1_08, identifier: DIR1}
  - {pin_num: J11, peripheral: LPI2C1, signal: SCL, pin_signal: GPIO_AD_B1_00, identifier: SCL, slew_rate: Fast}
  - {pin_num: K11, peripheral: LPI2C1, signal: SDA, pin_signal: GPIO_AD_B1_01, identifier: SDA, slew_rate: Fast}
  - {pin_num: L13, peripheral: LPUART8, signal: TX, pin_signal: GPIO_AD_B1_10, identifier: MTSR, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: J13, peripheral: LPUART8, signal: RX, pin_signal: GPIO_AD_B1_11, identifier: MRST, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: J14, peripheral: GPIO1, signal: 'gpio_io, 31', pin_signal: GPIO_AD_B1_15, identifier: DIRECT, direction: OUTPUT, pull_keeper_enable: Disable}
  - {pin_num: G13, peripheral: PWM1, signal: 'A, 3', pin_signal: GPIO_AD_B0_10, identifier: RIGHT, direction: OUTPUT, pull_keeper_select: no_init, pull_keeper_enable: Disable,
    slew_rate: Slow}
  - {pin_num: G10, peripheral: PWM1, signal: 'B, 3', pin_signal: GPIO_AD_B0_11, identifier: LEFT, direction: OUTPUT, pull_keeper_select: no_init, pull_keeper_enable: Disable}
  - {pin_num: B14, peripheral: PWM4, signal: 'A, 3', pin_signal: GPIO_B1_15, identifier: STEER, direction: OUTPUT, pull_keeper_select: no_init, pull_keeper_enable: Disable}
  - {pin_num: A11, peripheral: FLEXIO2, signal: 'IO, 16', pin_signal: GPIO_B1_00, identifier: BEEP, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: C13, peripheral: GPIO2, signal: 'gpio_io, 27', pin_signal: GPIO_B1_11, identifier: DC, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: D13, peripheral: GPIO2, signal: 'gpio_io, 28', pin_signal: GPIO_B1_12, identifier: RES, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: G12, peripheral: GPIO1, signal: 'gpio_io, 30', pin_signal: GPIO_AD_B1_14, identifier: CLK, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: H11, peripheral: GPIO1, signal: 'gpio_io, 29', pin_signal: GPIO_AD_B1_13, identifier: MOSI, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: L12, peripheral: ADC1, signal: 'IN, 9', pin_signal: GPIO_AD_B1_04, identifier: BAT}
  - {pin_num: C9, peripheral: PWM2, signal: 'B, 1', pin_signal: GPIO_B0_09, identifier: LED, direction: OUTPUT, speed: MHZ_50}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

